{"name":{"0":"Alice Sebold","1":"Rebecca Wells","2":"J. K. Rowling","3":"John Grisham","4":"Anne Rice","5":"Barbara Kingsolver","6":"Wally Lamb","7":"Michael Crichton","8":"James Patterson","9":"Fitch, Janet","10":"Thomas Harris","11":"J. R. R. Tolkien","12":"Neil Gaiman","13":"Frank McCourt","14":"Nicholas Sparks","15":"Janet Evanovich","16":"Jane Hamilton"},"bio":{"0":"No bio available","1":"No bio available","2":"Joanne \"Jo\" Murray, OBE (née Rowling), better known under the pen name J. K. Rowling, is a British author best known as the creator of the Harry Potter fantasy series, the idea for which was conceived whilst on a train trip from Manchester to London in 1990. The Potter books have gained worldwide attention, won multiple awards, sold more than 400 million copies, and been the basis for a popular series of films.","3":"No bio available","4":"Anne Rice was born on 04 October 1941 in New Orleans, Louisiana, USA. She was the second of four daughters of Irish Catholic parents, Katherine \"Kay\" Allen and Howard O'Brien. In 1961, she married Stan Rice, who passed away in 2002. They had two children, Christopher (1978) and Michele (1966-1972). She started to published in 1970s, and became a published phenomenon. Her books have sold nearly 100 million copies, making her one of the most widely read authors in modern history.","5":"Barbara Kingsolver is an American novelist, essayist and poet.","6":"No bio available","7":"An American writer and filmmaker.","8":"James Brendan Patterson (born March 22, 1947) is an American author. Among his works are the Alex Cross, Michael Bennett, Women's Murder Club, Maximum Ride, Daniel X, NYPD Red, Witch & Wizard, Private and Middle School series, as well as many stand-alone thrillers, non-fiction, and romance novels. His books have sold more than 425 million copies, and he was the first person to sell 1 million e-books. In 2016, Patterson topped Forbes's list of highest-paid authors for the third consecutive year, with an income of $95 million. His total income over a decade is estimated at $700 million.\r\n\r\nIn November 2015, Patterson received the Literarian Award from the National Book Foundation. Patterson has donated millions of dollars in grants and scholarship to various universities, teachers' colleges, independent bookstores, school libraries, and college students to promote literacy. [source](https:\/\/en.wikipedia.org\/wiki\/James_Patterson)","9":"No bio available","10":"No bio available","11":"No bio available","12":"Neil Richard MacKinnon Gaiman born Neil Richard Gaiman, 10 November 1960) is an English author of short fiction, novels, comic books, graphic novels, audio theatre, and films. His notable works include the comic book series The Sandman and novels Stardust, American Gods, Coraline, and The Graveyard Book. He has won numerous awards, including the Hugo, Nebula, and Bram Stoker awards, as well as the Newbery and Carnegie medals. He is the first author to win both the Newbery and the Carnegie medals for the same work, The Graveyard Book (2008). In 2013, The Ocean at the End of the Lane was voted Book of the Year in the British National Book Awards.","13":"Francis \"Frank\" McCourt was an Irish-American teacher and author. McCourt was born in Brooklyn; however, his family returned to their native Ireland in 1934.\r\n\r\nHe received the Pulitzer Prize (1997) and National Book Critics Circle Award (1996) for his memoir Angela's Ashes (1996), which details his childhood as a poor Irish Catholic in Limerick. He is also the author of 'Tis (1999), which continues the narrative of his life, picking up from the end of the previous book and focusing on life as a new immigrant in America. Teacher Man (2005), detailed the challenges of being a young, uncertain teacher who must impart knowledge to his students. His works are often part of the syllabus in high schools. In 2002 he was awarded an honorary degree from the University of Western Ontario. He died of melanoma, the deadliest form of skin cancer, at the age of 78.\r\n\r\nSource: Goodreads.com","14":"No bio available","15":"Janet Evanovich (born Janet Schneider; April 22, 1943) is an American writer. She began her career writing short contemporary romance novels under the pen name Steffie Hall, but gained fame authoring a series of contemporary mysteries featuring Stephanie Plum, a former lingerie buyer from Trenton, New Jersey, who becomes a bounty hunter to make ends meet after losing her job. The novels in this series have been on *The New York Times*, *USA Today*, *Wall Street Journal* and Amazon bestseller lists. Evanovich has had her last seventeen Plums debut at #1 on the NY Times Best Sellers list and eleven of them have hit #1 on *USA Today* Best-Selling Books list. She has over two hundred million books in print worldwide and is translated into over 40 languages. (taken from Wikipedia)","16":"Jane Hamilton was raised in Oak Park, Illinois, the youngest of five children. In 1979 she received a degree in English from Carleton College. In 1983, her first published short stories were published in Harper's Magazine in 1983. In 1988, her first novel, The Book of Ruth, was published. It won the Hemingway Foundation\/PEN Award, Great Lakes College Association New Writers Award, and the Wisconsin Library Association Banta Book Award in 1989, and was an Oprah's Book Club selection in 1996. In her second novel, A Map of the World, was published, followed by The Short History of a Prince in 1998. The Short History of a Prince was a Publishers Weekly Best Book of 1998 and was shortlisted for the 1999 Orange Prize. She currently lives in Rochester, Wisconsin."},"photos":{"0":"https:\/\/covers.openlibrary.org\/a\/olid\/OL1479823A-M.jpg","1":"https:\/\/covers.openlibrary.org\/a\/olid\/OL2624071A-M.jpg","2":"https:\/\/covers.openlibrary.org\/a\/olid\/OL23919A-M.jpg","3":"https:\/\/covers.openlibrary.org\/a\/olid\/OL10659458A-M.jpg","4":"https:\/\/covers.openlibrary.org\/a\/olid\/OL39486A-M.jpg","5":"https:\/\/covers.openlibrary.org\/a\/olid\/OL221083A-M.jpg","6":"https:\/\/covers.openlibrary.org\/a\/olid\/OL234131A-M.jpg","7":"https:\/\/covers.openlibrary.org\/a\/olid\/OL28257A-M.jpg","8":"https:\/\/covers.openlibrary.org\/a\/olid\/OL22258A-M.jpg","9":"https:\/\/covers.openlibrary.org\/a\/olid\/OL21224A-M.jpg","10":"https:\/\/covers.openlibrary.org\/a\/olid\/OL2032671A-M.jpg","11":"https:\/\/covers.openlibrary.org\/a\/olid\/OL13512970A-M.jpg","12":"https:\/\/covers.openlibrary.org\/a\/olid\/OL53305A-M.jpg","13":"https:\/\/covers.openlibrary.org\/a\/olid\/OL26363A-M.jpg","14":"https:\/\/covers.openlibrary.org\/a\/olid\/OL10132234A-M.jpg","15":"https:\/\/covers.openlibrary.org\/a\/olid\/OL21225A-M.jpg","16":"https:\/\/covers.openlibrary.org\/a\/olid\/OL2678121A-M.jpg"}}